[{"joke":"How much does a pirate earing cost? A buccaneer"},{"joke":"Why do they make Raisin Bran commercials? For raisin bran awareness."},{"joke":"What did the three holes in the ground say? Well, well, well."},{"joke":"What do you call a cow with no legs? Ground beef."},{"joke":"At the end of the Age of Dinosaurs what happened to the good ones? They got veloci-raptured."},{"joke":"What's a balloon's favorite genre of music? Pop."},{"joke":"One time, a cow saved my life It was bovine intervention."},{"joke":"Why should you never invite a boxer to a party? He always throws the punch."},{"joke":"What do you call a chef who's stingy with herbs? PARSLEYMONIOUS"},{"joke":"Why did the sheep go to the doctor? He had a baah-baah throat."},{"joke":"What's a comedian's favorite candy? Laffy Taffy."},{"joke":"What do you call Washington State after a long rain storm? Washed a Ton State."},{"joke":"How much does a Chinese elephant weigh? Wonton"},{"joke":"What do vegetarian zombies eat? Graaaaaaiiiins......"},{"joke":"I went to an ATM... I was at an ATM this morning and this older lady asked me to help check her balance, so I pushed her over."},{"joke":"Why was the healthy potato not allowed on the plane? He was on the \"No Fry\" list."},{"joke":"What did the host serve his guests for The Simpsons marathon night? Disco Stew!"},{"joke":"Why are contortionists always angry? Their work usually has them pretty bent out of shape."},{"joke":"Where do you learn to make ice cream? Sundae School"},{"joke":"Darth Vader told me he knows what i'm getting for Christmas He said he felt my presents..."},{"joke":"Did someone say \"purple\"? Sorry, it must have been a pigment of my imagination!"},{"joke":"Why don't bears wear boots? Because they like to walk around in their bear feet."},{"joke":"What do you call a cow that doesn't give milk? A Milk Dud."},{"joke":"How many hipsters does it take to change a lightbulb? It's a really obscure number. You've probably never heard of it."},{"joke":"Why did the cop wake up his son? To stop a kid napping."},{"joke":"How does a mathematician get Tan? Sin/Cos"},{"joke":"Why did the orange move to veggieland? So he could live in peas and hominy."},{"joke":"What do you call people who pretend to be Irish on St. Patrick's Day? Counterfitz"},{"joke":"Why did everyone trust the marsupial? Everything he said was troo"},{"joke":"Why did the duck go to the doctor? He had a billious fever."}]